energia/Energia/hardware/lm4f/boards.txt
##############################################################
lplm4f120h5qr.name=TivaLaunchPad w/ tm4c1233h6pm (80MHz)
lplm4f120h5qr.upload.maximum_size=262144
lplm4f120h5qr.build.mcu=cortex-m4
lplm4f120h5qr.build.f_cpu=80000000L
lplm4f120h5qr.build.core=lm4f
lplm4f120h5qr.build.variant=stellarpad
lplm4f120h5qr.ldscript=lm4fcpp.ld

##############################################################
 
